7767517
183 205
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input 856 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432
HardSwish        Div_5                    1 1 856 408 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_0              1 2 408 408_splitncnn_0 408_splitncnn_1
Convolution      Conv_6                   1 1 408_splitncnn_1 859 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             Relu_7                   1 1 859 411
ConvolutionDepthWise Conv_8                   1 1 411 862 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             Relu_9                   1 1 862 414
Convolution      Conv_10                  1 1 414 865 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Split            splitncnn_1              1 2 865 865_splitncnn_0 865_splitncnn_1
Convolution      Conv_11                  1 1 865_splitncnn_1 868 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=64
ReLU             Relu_12                  1 1 868 419
Convolution      Conv_13                  1 1 419 871 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=64
BinaryOp         Add_15                   1 1 871 423 0=0 1=1 2=3.000000e+00
Clip             Clip_18                  1 1 423 426 0=0.000000e+00 1=6.000000e+00
BinaryOp         Div_19                   1 1 426 429 0=3 1=1 2=6.000000e+00
BinaryOp         Mul_20                   2 1 865_splitncnn_0 429 430 0=2
BinaryOp         Add_21                   2 1 430 408_splitncnn_0 431 0=0
Convolution      Conv_22                  1 1 431 874 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1152
ReLU             Relu_23                  1 1 874 434
ConvolutionDepthWise Conv_24                  1 1 434 877 0=72 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=648 7=72
ReLU             Relu_25                  1 1 877 437
Convolution      Conv_26                  1 1 437 880 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
Split            splitncnn_2              1 2 880 880_splitncnn_0 880_splitncnn_1
Convolution      Conv_27                  1 1 880_splitncnn_1 883 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2112
ReLU             Relu_28                  1 1 883 442
ConvolutionDepthWise Conv_29                  1 1 442 886 0=88 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=792 7=88
ReLU             Relu_30                  1 1 886 445
Convolution      Conv_31                  1 1 445 889 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2112
BinaryOp         Add_32                   2 1 889 880_splitncnn_0 448 0=0
Split            splitncnn_3              1 2 448 448_splitncnn_0 448_splitncnn_1
Convolution      Conv_33                  1 1 448_splitncnn_1 892 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
HardSwish        Div_38                   1 1 892 461 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_39                  1 1 461 895 0=96 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
HardSwish        Div_44                   1 1 895 474 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_45                  1 1 474 898 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3840
Split            splitncnn_4              1 2 898 898_splitncnn_0 898_splitncnn_1
Convolution      Conv_46                  1 1 898_splitncnn_1 901 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=400
ReLU             Relu_47                  1 1 901 479
Convolution      Conv_48                  1 1 479 904 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=400
BinaryOp         Add_50                   1 1 904 483 0=0 1=1 2=3.000000e+00
Clip             Clip_53                  1 1 483 486 0=0.000000e+00 1=6.000000e+00
BinaryOp         Div_54                   1 1 486 489 0=3 1=1 2=6.000000e+00
BinaryOp         Mul_55                   2 1 898_splitncnn_0 489 490 0=2
Split            splitncnn_5              1 2 490 490_splitncnn_0 490_splitncnn_1
Convolution      Conv_56                  1 1 490_splitncnn_1 907 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
HardSwish        Div_61                   1 1 907 503 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_62                  1 1 503 910 0=240 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=6000 7=240
HardSwish        Div_67                   1 1 910 516 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_68                  1 1 516 913 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
Split            splitncnn_6              1 2 913 913_splitncnn_0 913_splitncnn_1
Convolution      Conv_69                  1 1 913_splitncnn_1 916 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=400
ReLU             Relu_70                  1 1 916 521
Convolution      Conv_71                  1 1 521 919 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=400
BinaryOp         Add_73                   1 1 919 525 0=0 1=1 2=3.000000e+00
Clip             Clip_76                  1 1 525 528 0=0.000000e+00 1=6.000000e+00
BinaryOp         Div_77                   1 1 528 531 0=3 1=1 2=6.000000e+00
BinaryOp         Mul_78                   2 1 913_splitncnn_0 531 532 0=2
BinaryOp         Add_79                   2 1 532 490_splitncnn_0 533 0=0
Split            splitncnn_7              1 2 533 533_splitncnn_0 533_splitncnn_1
Convolution      Conv_80                  1 1 533_splitncnn_1 922 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
HardSwish        Div_85                   1 1 922 546 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_86                  1 1 546 925 0=240 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=6000 7=240
HardSwish        Div_91                   1 1 925 559 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_92                  1 1 559 928 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
Split            splitncnn_8              1 2 928 928_splitncnn_0 928_splitncnn_1
Convolution      Conv_93                  1 1 928_splitncnn_1 931 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=400
ReLU             Relu_94                  1 1 931 564
Convolution      Conv_95                  1 1 564 934 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=400
BinaryOp         Add_97                   1 1 934 568 0=0 1=1 2=3.000000e+00
Clip             Clip_100                 1 1 568 571 0=0.000000e+00 1=6.000000e+00
BinaryOp         Div_101                  1 1 571 574 0=3 1=1 2=6.000000e+00
BinaryOp         Mul_102                  2 1 928_splitncnn_0 574 575 0=2
BinaryOp         Add_103                  2 1 575 533_splitncnn_0 576 0=0
Split            splitncnn_9              1 2 576 576_splitncnn_0 576_splitncnn_1
Convolution      Conv_104                 1 1 576_splitncnn_1 937 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
HardSwish        Div_109                  1 1 937 589 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_110                 1 1 589 940 0=120 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=3000 7=120
HardSwish        Div_115                  1 1 940 602 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_116                 1 1 602 943 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5760
Split            splitncnn_10             1 2 943 943_splitncnn_0 943_splitncnn_1
Convolution      Conv_117                 1 1 943_splitncnn_1 946 0=12 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_118                 1 1 946 607
Convolution      Conv_119                 1 1 607 949 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
BinaryOp         Add_121                  1 1 949 611 0=0 1=1 2=3.000000e+00
Clip             Clip_124                 1 1 611 614 0=0.000000e+00 1=6.000000e+00
BinaryOp         Div_125                  1 1 614 617 0=3 1=1 2=6.000000e+00
BinaryOp         Mul_126                  2 1 943_splitncnn_0 617 618 0=2
Split            splitncnn_11             1 2 618 618_splitncnn_0 618_splitncnn_1
Convolution      Conv_127                 1 1 618_splitncnn_1 952 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6912
HardSwish        Div_132                  1 1 952 631 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_133                 1 1 631 955 0=144 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=3600 7=144
HardSwish        Div_138                  1 1 955 644 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_139                 1 1 644 958 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6912
Split            splitncnn_12             1 2 958 958_splitncnn_0 958_splitncnn_1
Convolution      Conv_140                 1 1 958_splitncnn_1 961 0=12 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_141                 1 1 961 649
Convolution      Conv_142                 1 1 649 964 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
BinaryOp         Add_144                  1 1 964 653 0=0 1=1 2=3.000000e+00
Clip             Clip_147                 1 1 653 656 0=0.000000e+00 1=6.000000e+00
BinaryOp         Div_148                  1 1 656 659 0=3 1=1 2=6.000000e+00
BinaryOp         Mul_149                  2 1 958_splitncnn_0 659 660 0=2
BinaryOp         Add_150                  2 1 660 618_splitncnn_0 661 0=0
Split            splitncnn_13             1 2 661 661_splitncnn_0 661_splitncnn_1
Convolution      Conv_151                 1 1 661_splitncnn_1 967 0=288 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13824
HardSwish        Div_156                  1 1 967 674 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_157                 1 1 674 970 0=288 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=7200 7=288
HardSwish        Div_162                  1 1 970 687 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_163                 1 1 687 973 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Split            splitncnn_14             1 2 973 973_splitncnn_0 973_splitncnn_1
Convolution      Conv_164                 1 1 973_splitncnn_1 976 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_165                 1 1 976 692
Convolution      Conv_166                 1 1 692 979 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
BinaryOp         Add_168                  1 1 979 696 0=0 1=1 2=3.000000e+00
Clip             Clip_171                 1 1 696 699 0=0.000000e+00 1=6.000000e+00
BinaryOp         Div_172                  1 1 699 702 0=3 1=1 2=6.000000e+00
BinaryOp         Mul_173                  2 1 973_splitncnn_0 702 703 0=2
Split            splitncnn_15             1 2 703 703_splitncnn_0 703_splitncnn_1
Convolution      Conv_174                 1 1 703_splitncnn_1 982 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
HardSwish        Div_179                  1 1 982 716 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_180                 1 1 716 985 0=576 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=14400 7=576
HardSwish        Div_185                  1 1 985 729 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_186                 1 1 729 988 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Split            splitncnn_16             1 2 988 988_splitncnn_0 988_splitncnn_1
Convolution      Conv_187                 1 1 988_splitncnn_1 991 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_188                 1 1 991 734
Convolution      Conv_189                 1 1 734 994 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
BinaryOp         Add_191                  1 1 994 738 0=0 1=1 2=3.000000e+00
Clip             Clip_194                 1 1 738 741 0=0.000000e+00 1=6.000000e+00
BinaryOp         Div_195                  1 1 741 744 0=3 1=1 2=6.000000e+00
BinaryOp         Mul_196                  2 1 988_splitncnn_0 744 745 0=2
BinaryOp         Add_197                  2 1 745 703_splitncnn_0 746 0=0
Split            splitncnn_17             1 2 746 746_splitncnn_0 746_splitncnn_1
Convolution      Conv_198                 1 1 746_splitncnn_1 997 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
HardSwish        Div_203                  1 1 997 759 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_204                 1 1 759 1000 0=576 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=14400 7=576
HardSwish        Div_209                  1 1 1000 772 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_210                 1 1 772 1003 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Split            splitncnn_18             1 2 1003 1003_splitncnn_0 1003_splitncnn_1
Convolution      Conv_211                 1 1 1003_splitncnn_1 1006 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_212                 1 1 1006 777
Convolution      Conv_213                 1 1 777 1009 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
BinaryOp         Add_215                  1 1 1009 781 0=0 1=1 2=3.000000e+00
Clip             Clip_218                 1 1 781 784 0=0.000000e+00 1=6.000000e+00
BinaryOp         Div_219                  1 1 784 787 0=3 1=1 2=6.000000e+00
BinaryOp         Mul_220                  2 1 1003_splitncnn_0 787 788 0=2
BinaryOp         Add_221                  2 1 788 746_splitncnn_0 789 0=0
Convolution      Conv_222                 1 1 789 1012 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_223                 1 1 1012 792
Split            splitncnn_19             1 2 792 792_splitncnn_0 792_splitncnn_1
Convolution      Conv_224                 1 1 661_splitncnn_0 1015 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
ReLU             Relu_225                 1 1 1015 795
Convolution      Conv_226                 1 1 576_splitncnn_0 1018 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3840
ReLU             Relu_227                 1 1 1018 798
Convolution      Conv_228                 1 1 448_splitncnn_0 1021 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_229                 1 1 1021 801
Interp           Resize_231               1 1 792_splitncnn_1 806 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
BinaryOp         Add_232                  2 1 806 795 807 0=0
Split            splitncnn_20             1 2 807 807_splitncnn_0 807_splitncnn_1
Interp           Resize_234               1 1 807_splitncnn_1 812 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
BinaryOp         Add_235                  2 1 812 798 813 0=0
Split            splitncnn_21             1 2 813 813_splitncnn_0 813_splitncnn_1
Interp           Resize_237               1 1 813_splitncnn_1 818 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
BinaryOp         Add_238                  2 1 818 801 819 0=0
Convolution      Conv_239                 1 1 792_splitncnn_0 1024 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=20736
ReLU             Relu_240                 1 1 1024 822
Interp           Resize_242               1 1 822 827 0=1 1=8.000000e+00 2=8.000000e+00 3=0 4=0 6=0
Convolution      Conv_243                 1 1 807_splitncnn_0 1027 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=20736
ReLU             Relu_244                 1 1 1027 830
Interp           Resize_246               1 1 830 835 0=1 1=4.000000e+00 2=4.000000e+00 3=0 4=0 6=0
Convolution      Conv_247                 1 1 813_splitncnn_0 1030 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=20736
ReLU             Relu_248                 1 1 1030 838
Interp           Resize_250               1 1 838 843 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Convolution      Conv_251                 1 1 819 1033 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=20736
ReLU             Relu_252                 1 1 1033 846
Concat           Concat_253               4 1 827 835 843 846 847 0=0
Convolution      Conv_254                 1 1 847 1036 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=20736
ReLU             Relu_255                 1 1 1036 850
Deconvolution    ConvTranspose_256        1 1 850 851 0=24 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=2304
BatchNorm        BatchNormalization_257   1 1 851 852 0=24
ReLU             Relu_258                 1 1 852 853
Deconvolution    ConvTranspose_259        1 1 853 854 0=1 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=96
Sigmoid          Sigmoid_260              1 1 854 output
