7767517
78 84
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input 195 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432
HardSwish        Div_5                    1 1 195 206 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_6                   1 1 206 495 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
ReLU             Relu_7                   1 1 495 209
ConvolutionDepthWise Conv_8                   1 1 209 210 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             Relu_9                   1 1 210 211
Convolution      Conv_10                  1 1 211 498 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Convolution      Conv_11                  1 1 498 501 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1152
ReLU             Relu_12                  1 1 501 216
ConvolutionDepthWise Conv_13                  1 1 216 217 0=72 1=3 11=3 2=1 12=1 3=1 13=2 4=1 14=1 15=1 16=1 5=1 6=648 7=72
ReLU             Relu_14                  1 1 217 218
Convolution      Conv_15                  1 1 218 504 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
Split            splitncnn_0              1 2 504 504_splitncnn_0 504_splitncnn_1
Convolution      Conv_16                  1 1 504_splitncnn_1 507 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2112
ReLU             Relu_17                  1 1 507 223
ConvolutionDepthWise Conv_18                  1 1 223 224 0=88 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=792 7=88
ReLU             Relu_19                  1 1 224 225
Convolution      Conv_20                  1 1 225 510 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2112
BinaryOp         Add_21                   2 1 504_splitncnn_0 510 228 0=0
Convolution      Conv_22                  1 1 228 513 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
HardSwish        Div_27                   1 1 513 241 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_28                  1 1 241 242 0=96 1=5 11=5 2=1 12=1 3=1 13=2 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
HardSwish        Div_33                   1 1 242 253 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_34                  1 1 253 516 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3840
Split            splitncnn_1              1 2 516 516_splitncnn_0 516_splitncnn_1
Convolution      Conv_35                  1 1 516_splitncnn_1 519 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
HardSwish        Div_40                   1 1 519 268 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_41                  1 1 268 269 0=240 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=6000 7=240
HardSwish        Div_46                   1 1 269 280 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_47                  1 1 280 522 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
BinaryOp         Add_48                   2 1 516_splitncnn_0 522 283 0=0
Split            splitncnn_2              1 2 283 283_splitncnn_0 283_splitncnn_1
Convolution      Conv_49                  1 1 283_splitncnn_1 525 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
HardSwish        Div_54                   1 1 525 296 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_55                  1 1 296 297 0=240 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=6000 7=240
HardSwish        Div_60                   1 1 297 308 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_61                  1 1 308 528 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
BinaryOp         Add_62                   2 1 283_splitncnn_0 528 311 0=0
Convolution      Conv_63                  1 1 311 531 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
HardSwish        Div_68                   1 1 531 324 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_69                  1 1 324 325 0=120 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=3000 7=120
HardSwish        Div_74                   1 1 325 336 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_75                  1 1 336 534 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5760
Split            splitncnn_3              1 2 534 534_splitncnn_0 534_splitncnn_1
Convolution      Conv_76                  1 1 534_splitncnn_1 537 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6912
HardSwish        Div_81                   1 1 537 351 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_82                  1 1 351 352 0=144 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=3600 7=144
HardSwish        Div_87                   1 1 352 363 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_88                  1 1 363 540 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6912
BinaryOp         Add_89                   2 1 534_splitncnn_0 540 366 0=0
Convolution      Conv_90                  1 1 366 543 0=288 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=13824
HardSwish        Div_95                   1 1 543 379 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_96                  1 1 379 380 0=288 1=5 11=5 2=1 12=1 3=1 13=2 4=2 14=2 15=2 16=2 5=1 6=7200 7=288
HardSwish        Div_101                  1 1 380 391 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_102                 1 1 391 546 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Split            splitncnn_4              1 2 546 546_splitncnn_0 546_splitncnn_1
Convolution      Conv_103                 1 1 546_splitncnn_1 549 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
HardSwish        Div_108                  1 1 549 406 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_109                 1 1 406 407 0=576 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=14400 7=576
HardSwish        Div_114                  1 1 407 418 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_115                 1 1 418 552 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_116                  2 1 546_splitncnn_0 552 421 0=0
Split            splitncnn_5              1 2 421 421_splitncnn_0 421_splitncnn_1
Convolution      Conv_117                 1 1 421_splitncnn_1 555 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
HardSwish        Div_122                  1 1 555 434 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_123                 1 1 434 435 0=576 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=14400 7=576
HardSwish        Div_128                  1 1 435 446 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_129                 1 1 446 558 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_130                  2 1 421_splitncnn_0 558 449 0=0
Convolution      Conv_131                 1 1 449 561 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
HardSwish        Div_136                  1 1 561 462 0=1.666667e-01 1=5.000000e-01
Pooling          MaxPool_137              1 1 462 463 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Convolution      Conv_138                 1 1 463 564 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=73728
HardSwish        Div_143                  1 1 564 476 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_144                 1 1 476 477 0=6086 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=779008
Reshape          Reshape_158              1 1 477 493 0=-1 1=6086
Permute          Transpose_159            1 1 493 output 0=1
