7767517
53 59
Input                    input                    0 1 input
Convolution              Conv_0                   1 1 input 206 0=16 1=3 3=2 4=1 5=1 6=432 8=102 9=6 -23310=2,1.666667e-01,5.000000e-01
Convolution              Conv_6                   1 1 206 209 0=16 1=1 5=1 6=256 8=102 9=1
ConvolutionDepthWise     Conv_8                   1 1 209 211 0=16 1=3 4=1 5=1 6=144 7=16 8=101 9=1
Convolution              Conv_10                  1 1 211 498 0=16 1=1 5=1 6=256 8=102
Convolution              Conv_11                  1 1 498 216 0=72 1=1 5=1 6=1152 8=102 9=1
ConvolutionDepthWise     Conv_13                  1 1 216 218 0=72 1=3 13=2 4=1 5=1 6=648 7=72 8=101 9=1
Convolution              Conv_15                  1 1 218 504 0=24 1=1 5=1 6=1728 8=2
Split                    splitncnn_0              1 2 504 504_splitncnn_0 504_splitncnn_1
Convolution              Conv_16                  1 1 504_splitncnn_1 223 0=88 1=1 5=1 6=2112 8=102 9=1
ConvolutionDepthWise     Conv_18                  1 1 223 225 0=88 1=3 4=1 5=1 6=792 7=88 8=101 9=1
Convolution              Conv_20                  1 1 225 510 0=24 1=1 5=1 6=2112 8=2
BinaryOp                 Add_21                   2 1 504_splitncnn_0 510 228
Convolution              Conv_22                  1 1 228 241 0=96 1=1 5=1 6=2304 8=102 9=6 -23310=2,1.666667e-01,5.000000e-01
ConvolutionDepthWise     Conv_28                  1 1 241 253 0=96 1=5 13=2 4=2 5=1 6=2400 7=96 8=101 9=6 -23310=2,1.666667e-01,5.000000e-01
Convolution              Conv_34                  1 1 253 516 0=40 1=1 5=1 6=3840 8=2
Split                    splitncnn_1              1 2 516 516_splitncnn_0 516_splitncnn_1
Convolution              Conv_35                  1 1 516_splitncnn_1 268 0=240 1=1 5=1 6=9600 8=102 9=6 -23310=2,1.666667e-01,5.000000e-01
ConvolutionDepthWise     Conv_41                  1 1 268 280 0=240 1=5 4=2 5=1 6=6000 7=240 8=101 9=6 -23310=2,1.666667e-01,5.000000e-01
Convolution              Conv_47                  1 1 280 522 0=40 1=1 5=1 6=9600 8=2
BinaryOp                 Add_48                   2 1 516_splitncnn_0 522 283
Split                    splitncnn_2              1 2 283 283_splitncnn_0 283_splitncnn_1
Convolution              Conv_49                  1 1 283_splitncnn_1 296 0=240 1=1 5=1 6=9600 8=102 9=6 -23310=2,1.666667e-01,5.000000e-01
ConvolutionDepthWise     Conv_55                  1 1 296 308 0=240 1=5 4=2 5=1 6=6000 7=240 8=101 9=6 -23310=2,1.666667e-01,5.000000e-01
Convolution              Conv_61                  1 1 308 528 0=40 1=1 5=1 6=9600 8=2
BinaryOp                 Add_62                   2 1 283_splitncnn_0 528 311
Convolution              Conv_63                  1 1 311 324 0=120 1=1 5=1 6=4800 8=102 9=6 -23310=2,1.666667e-01,5.000000e-01
ConvolutionDepthWise     Conv_69                  1 1 324 336 0=120 1=5 4=2 5=1 6=3000 7=120 8=101 9=6 -23310=2,1.666667e-01,5.000000e-01
Convolution              Conv_75                  1 1 336 534 0=48 1=1 5=1 6=5760 8=2
Split                    splitncnn_3              1 2 534 534_splitncnn_0 534_splitncnn_1
Convolution              Conv_76                  1 1 534_splitncnn_1 351 0=144 1=1 5=1 6=6912 8=102 9=6 -23310=2,1.666667e-01,5.000000e-01
ConvolutionDepthWise     Conv_82                  1 1 351 363 0=144 1=5 4=2 5=1 6=3600 7=144 8=101 9=6 -23310=2,1.666667e-01,5.000000e-01
Convolution              Conv_88                  1 1 363 540 0=48 1=1 5=1 6=6912 8=2
BinaryOp                 Add_89                   2 1 534_splitncnn_0 540 366
Convolution              Conv_90                  1 1 366 379 0=288 1=1 5=1 6=13824 8=102 9=6 -23310=2,1.666667e-01,5.000000e-01
ConvolutionDepthWise     Conv_96                  1 1 379 391 0=288 1=5 13=2 4=2 5=1 6=7200 7=288 8=101 9=6 -23310=2,1.666667e-01,5.000000e-01
Convolution              Conv_102                 1 1 391 546 0=96 1=1 5=1 6=27648 8=2
Split                    splitncnn_4              1 2 546 546_splitncnn_0 546_splitncnn_1
Convolution              Conv_103                 1 1 546_splitncnn_1 406 0=576 1=1 5=1 6=55296 8=102 9=6 -23310=2,1.666667e-01,5.000000e-01
ConvolutionDepthWise     Conv_109                 1 1 406 418 0=576 1=5 4=2 5=1 6=14400 7=576 8=101 9=6 -23310=2,1.666667e-01,5.000000e-01
Convolution              Conv_115                 1 1 418 552 0=96 1=1 5=1 6=55296 8=2
BinaryOp                 Add_116                  2 1 546_splitncnn_0 552 421
Split                    splitncnn_5              1 2 421 421_splitncnn_0 421_splitncnn_1
Convolution              Conv_117                 1 1 421_splitncnn_1 434 0=576 1=1 5=1 6=55296 8=102 9=6 -23310=2,1.666667e-01,5.000000e-01
ConvolutionDepthWise     Conv_123                 1 1 434 446 0=576 1=5 4=2 5=1 6=14400 7=576 8=101 9=6 -23310=2,1.666667e-01,5.000000e-01
Convolution              Conv_129                 1 1 446 558 0=96 1=1 5=1 6=55296 8=2
BinaryOp                 Add_130                  2 1 421_splitncnn_0 558 449
Convolution              Conv_131                 1 1 449 462 0=576 1=1 5=1 6=55296 8=2 9=6 -23310=2,1.666667e-01,5.000000e-01
Pooling                  MaxPool_137              1 1 462 463 1=2 2=2 5=1
Convolution              Conv_138                 1 1 463 476 0=128 1=1 5=1 6=73728 8=102 9=6 -23310=2,1.666667e-01,5.000000e-01
Convolution              Conv_144                 1 1 476 477 0=6086 1=1 5=1 6=779008 8=2
Reshape                  Reshape_158              1 1 477 493 0=-1 1=6086
Permute                  Transpose_159            1 1 493 output 0=1
